import numpy as np
from consts.experiment import CORTEX_OPTS

GRID_REGIONS = [
    '位置_当前特征',
    '位置_锚点特征',
    '位置_整体中心',
    '位置_当前特征相对锚点特征的偏移',
    '位置_当前特征相对整体中心的偏移',
]

REGION_AND_SYNAPSE_META = {
    'visual_field_wh':
    np.array([28, 28]),
    'region_names': [
        '全局调控',
        *([
            '全流程调控',
            '点',
            '方位',
            '线_轮廓直线',
            '线_射线',
            '角',
            '轮廓中心',
            '外轮廓边界',
        ] if CORTEX_OPTS['IS_MOCK_RECORD_PROPS'] == 0 else []),
        *GRID_REGIONS,
        '属性',
        '数字',
    ],
    # 'form_synapse_rules': [
    #     *([
    #         '全流程调控',

    #         # # 边缘点
    #         # '点-锐化输入',
    #         # '点-消除锯齿',
    #         # '点-激励边缘点',

    #         # #方位
    #         # '方位-各种点激励各种方位',
    #         # # '方位-边缘点激励轮廓方位',
    #         # # '方位-像素点激励像素点方位',
    #         # # '方位-内轮廓直线激励缺口方位',

    #         # # 线
    #         # '线-轮廓方位激励轮廓直线',
    #         # # '线-轮廓方位激励缺口直线',
    #         # # '线-轮廓方位和缺口方位激励缺口直线',
    #         # '线-轮廓方位激励射线',

    #         # # 轮廓中心
    #         # '轮廓中心-轮廓直线激励轮廓中心',
    #         # # '轮廓中心-外轮廓方位激励外轮廓边界',

    #         # # 角
    #         # '角-射线激励角',

    #         # # 注意力竞争
    #         # '注意力-注意力竞争',

    #         # # 轮廓中心的反馈
    #         # '线-轮廓中心反馈激励轮廓直线',
    #         # '方位-轮廓直线反馈激励轮廓方位',

    #         # # 角的反馈
    #         # '线-角反馈激励射线',
    #         # '方位-射线反馈激励垂直方位',

    #         # # 点的反馈调节
    #         # '点-轮廓方位反馈激励边缘点',
    #         # '点-根据反馈调节边缘点激励边缘方位',

    #         # # 位置
    #         # '位置-激励特征位置和整体中心位置',
    #         # '位置-激励当前特征相对整体中心的偏移',
    #         # '位置-激励当前特征相对锚点特征的偏移',

    #         # 属性
    #         '属性-特征激励属性',
    #         '属性-绝对属性激励相对属性',
    #         '属性-锚点的绝对属性激励相对锚点的属性',
    #         '属性-出现持续消失_个体编码',
    #         '属性-个体编码激励群体编码',
    #     ] if CORTEX_OPTS['IS_MOCK_RECORD_PROPS'] == 0 else [
    #         # '属性-传递标志物给数字的树突棘',
    #         '属性-个体编码激励群体编码',

    #         # 数字
    #         '数字-累积数字预测',
    #         '数字-onehot数字预测',
    #         '数字-前馈预测意外和偏差',
    #         # '数字-建立树突棘竞争关系',
    #     ]),

    #     # # 行动
    #     # '行动-得出结论',
    # ],
    # 'form_posterior_synapse_rules': [
    #     '属性-通用前馈预测',
    # ] if CORTEX_OPTS['enable_posterior_form'] == 1 else [],
}